In [1]:
# 25-07-2023

In [2]:
import pandas as pd
import sqlalchemy as sa

In [3]:
#database URL
# need driver
# Adapter
# ---------------------
# username
# Password
# ---------------------
# Host 
# port
# database (Catalog)

In [4]:
db_secret = {
    'drivername' : 'postgresql+psycopg2',
    'host'       : 'mmai5100postgres.canadacentral.cloudapp.azure.com',
    'port'       :'5432',
    'username'   : 'sriku241',
    'password'   :'2023!Schulich',
    'database'   :'mban_db',
    
}

In [5]:
db_connection_url = sa.engine.URL.create(
    drivername = db_secret['drivername'],
    username   = db_secret['username'],
    password   = db_secret['password'],
    host       = db_secret['host'],
    port       = db_secret['port'],
    database   = db_secret['database']
)

In [6]:
db_connection_url

postgresql+psycopg2://sriku241:***@mmai5100postgres.canadacentral.cloudapp.azure.com:5432/mban_db

# create an engine

In [7]:
engine = sa.create_engine(db_connection_url)

In [8]:
with engine.connect() as connection :
    data = pd.read_sql('SELECT * FROM dimensions.customer_dimension;',con=connection)

In [9]:
data

,sk_customer,customer_id,first_name,last_name,email,birthdate
0,1064,111,Marge,Simpson,marge.simpson@springfield.com,1956-03-19
1,2027,222,Homer,Simpson,homer.simpson@springfield.com,1956-05-12
2,4242,444,Lisa,Simpson,lisa.simpson@springfield.com,1982-05-09
3,5432,555,Maggie,Simpson,maggie.simpson@springfield.com,1989-01-14
4,3666,333,Bart,Simpson,bart.simpson@springfield.com,1980-02-23

In [10]:
with engine.connect() as connection :
    data1 = pd.read_sql('SELECT * FROM fact_tables.conversions;',con=connection)

In [11]:
data1

,conversion_id,conversion_date,fk_conversion_date,fk_customer,fk_product,conversion_type,conversion_channel,order_number,discount_value
0,2999,2020-01-02,20200102,2027,24664,activation,Social Media,511862806,20.00
1,1111,2019-01-03,20190103,1064,9138,activation,Email,558863286,129.99
2,1984,2020-03-26,20200326,1064,24468,reactivation,Organic Reactivation,509646546,0.00
3,3422,2021-02-19,20210219,3666,35138,activation,Affiliate,504230754,120.00
4,3693,2022-01-15,20220115,3666,35134,reactivation,Direct Mail CRM,551972720,61.98
5,4545,2021-07-15,20210715,4242,35138,activation,Direct Mail CRM,507050380,190.75
6,3693,2023-02-27,20230227,3666,35134,reactivation,SMS,651972666,50.00
7,9876,2023-07-10,20230710,9999,9138,activation,Social Media,696785432,200.00

In [12]:
db_secret = {
    'drivername' : 'postgresql+psycopg2',
    'host'       : 'mmai5100postgres.canadacentral.cloudapp.azure.com',
    'port'       :'5432',
    'username'   : 'sriku241',
    'password'   :'2023!Schulich',
    'database'   :'sriku241_db',
    
}

In [13]:
db_connection_url = sa.engine.URL.create(
    drivername = db_secret['drivername'],
    username   = db_secret['username'],
    password   = db_secret['password'],
    host       = db_secret['host'],
    port       = db_secret['port'],
    database   = db_secret['database']
)

In [14]:
db_connection_url

postgresql+psycopg2://sriku241:***@mmai5100postgres.canadacentral.cloudapp.azure.com:5432/sriku241_db

In [15]:
engine = sa.create_engine(db_connection_url)

In [16]:
with engine.connect() as connection :
    connection.execute('CREATE SCHEMA IF NOT EXISTS test_test_test')

### Insert data into the database using Pandas

In [18]:
create_table_query = '''
CREATE TABLE IF NOT EXISTS test_test_test.hell(
student_id INT,
first_name VARCHAR(25),
last_name VARCHAR(25)
);
'''

with engine.connect() as connection :
    connection.execute('CREATE SCHEMA IF NOT EXISTS test_test_test')
    connection.execute(create_table_query)

In [19]:
student_data = {
    'student_id': [1,2,3],
    'first_name' : ['Michael','Scottie','Dennis'],
    'last_name' : ['Jordan','Pippen','Rodman']
}

In [20]:
students = pd.DataFrame(data=student_data)
students

   student_id first_name last_name
0           1    Michael    Jordan
1           2    Scottie    Pippen
2           3     Dennis    Rodman

In [21]:
students.to_sql(
name = 'hell',
schema = 'test_test_test',
con = engine,
if_exists = 'replace',
index =False,
    method = 'multi',
    dtype = {
        'student_id': sa.types.INTEGER,
        'first_name' : sa.types.VARCHAR(25),
        'last_name' : sa.types.VARCHAR(25)
    }
)